---
kind: type
id: T:Autodesk.Revit.UI.Events.ThemeChangedEventArgs
source: html/5525aa02-cbb1-145a-07ff-cccd62ef932d.htm
---
# Autodesk.Revit.UI.Events.ThemeChangedEventArgs

The event arguments used by the ThemeChanged event.

## Syntax (C#)
```csharp
public class ThemeChangedEventArgs : RevitAPISingleEventArgs
```